tap 'homebrew/cask-versions'
cask_args appdir: '/Applications'

# Language {{{1
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'python'
cask 'miniforge'
brew 'lua'
brew 'nodebrew'
# brew 'node', args: ['with-full-icu']
# brew 'npm'
brew 'zsh'
brew 'go'
tap 'dart-lang/dart'
brew 'dart'

# Utility {{{1
cask 'alfred'
cask 'spectacle'
cask 'witch'
cask 'karabiner-elements'

# Application {{{1
cask 'coteditor'
cask 'google-japanese-ime'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'appcleaner'
cask 'ios-console'
cask 'imageoptim'
cask 'image2icon'
cask 'deepl'
cask 'miro'
cask 'vnc-viewer'

# Command {{{1
# gitははじめに手動でいれる
# brew 'git'
brew 'curl'
brew 'wget'
brew 'openssl'
brew 'coreutils'
brew 'findutils'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'git-now'
brew 'git-flow'
brew 'git-jump'
tap 'heroku/brew'
brew 'heroku'
brew 'fzf'
brew 'tree'
brew 'gh'
brew 'rename'
brew 'make'
brew 'cmake'
brew 'ghostscript'
brew 'gnu-sed'
brew 'cowsay'
brew 'figlet'
brew 'ripgrep'
brew 'bat'
brew 'exa'
brew 'fd'
brew 'mawk'
brew 'itchyny/tap/mmv'
brew 'translate-shell'
cask 'ngrok'

# Vim {{{1
brew 'macvim'
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']
brew 'cmigemo'
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'jq'  # json parser
brew 'jvgrep'
brew 'neovim'
tap 'lambdalisue/neovim-qt'
brew 'neovim-qt'
brew 'w3m'

# My Formulas {{{1
tap 'zeero/my-formulas'
brew 'go-gtran'
brew 'git-info'
brew 'py-markdown2ctags'
cask 'font-ricty_diminished-devicon'

# Development Tool {{{1
cask 'sourcetree'
brew 'jsonlint'
brew 'terminal-notifier'
brew 'homebrew/cask/docker'
brew 'docker'
brew 'docker-compose'
brew 'ghq'
brew 'gibo'
brew 'mint'
cask 'google-cloud-sdk'
cask 'github'
cask 'android-studio'
cask 'adoptopenjdk8'
brew 'robotsandpencils/made/xcodes'
brew 'aria2'
cask 'proxyman'

# AppStore {{{1
brew 'mas'
mas 'Apple Configurator 2', id: 1037126344
mas 'Pocket', id: 568494494
mas 'Gapplin', id: 768053424 # SVG Viewer
