cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# language {{{1
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'python'
brew 'lua'
brew 'nodebrew'
# brew 'node', args: ['with-full-icu']
# brew 'npm'
brew 'zsh'
cask 'java'
brew 'go'

# command {{{1
# gitははじめに手動でいれる
# brew 'git'
brew 'cask'
brew 'curl'
brew 'wget'
brew 'openssl'
brew 'coreutils'
brew 'findutils'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'git-flow'
tap 'heroku/brew'
brew 'heroku'
brew 'fzf'
brew 'tree'
brew 'hub'
brew 'rename'
brew 'cmake'
brew 'ghostscript'
brew 'gnu-sed'
brew 'cowsay'
brew 'figlet'

# vim {{{1
brew 'macvim'
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']
brew 'cmigemo'
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'jq'  # json parser
brew 'jvgrep'
brew 'neovim'
tap 'lambdalisue/neovim-qt'
brew 'neovim-qt'
brew 'w3m'

# my formulas {{{1
tap 'zeero/my-formulas'
brew 'go-gtran'

# development tool {{{1
cask 'realm-studio'
cask 'sourcetree'
brew 'jsonlint'
brew 'terminal-notifier'
brew 'docker'
cask 'docker'
brew 'ghq'
brew 'gibo'
brew 'mint'

# utility {{{1
cask 'alfred'
cask 'clipy'
cask 'spectacle'
cask 'witch'

# application {{{1
cask 'iterm2'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'appcleaner'
cask 'skitch'
cask 'imageoptim'
cask 'coteditor'
cask 'slack'
cask 'ios-console'
cask 'image2icon'

