cask_args appdir: '/Applications'

# Utility {{{1
cask 'alfred'
cask 'raycast'
cask 'karabiner-elements'
cask 'bitwarden'

# Language {{{1
brew 'mise'
brew 'uv'
brew 'lua'
brew 'go'
brew 'dart-sdk'
brew 'kotlin'
brew 'kdoctor'

# Application {{{1
cask 'coteditor'
cask 'google-japanese-ime'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'appcleaner'
cask 'imageoptim'
cask 'image2icon'
cask 'deepl'
cask 'miro'
cask 'vnc-viewer'

# Command {{{1
# gitははじめに手動でいれる
# brew 'git'
brew 'curl'
brew 'wget'
brew 'openssl'
brew 'coreutils'
brew 'findutils'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'git-now'
brew 'git-flow'
brew 'fzf'
brew 'tree'
brew 'gh'
brew 'rename'
brew 'make'
brew 'cmake'
brew 'ghostscript'
brew 'gnu-sed'
brew 'cowsay'
brew 'figlet'
brew 'ripgrep'
brew 'bat'
brew 'eza'
brew 'fd'
brew 'mawk'
tap 'itchyny/tap'
brew 'mmv'
brew 'translate-shell'
cask 'ngrok'

# Vim {{{1
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags'
brew 'cmigemo'
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'jq'  # json parser
brew 'jvgrep'
brew 'neovim'
cask 'vimr'
brew 'w3m'

# AI {{{1
cask 'claude-code'
brew 'github-mcp-server'
cask 'antigravity'

# My Formulas {{{1
tap 'zeero/my-formulas'
brew 'go-gtran'
brew 'git-info'
brew 'git-jump'
cask 'font-ricty_diminished-devicon'

# Development Tool {{{1
brew 'qt'  # C++ framework (required for Ruby build)
brew 'jsonlint'
brew 'terminal-notifier'
brew 'docker'
brew 'docker-compose'
brew 'colima' # docker daemon
brew 'ghq'
brew 'gibo'
brew 'mint'
cask 'gcloud-cli'
cask 'github'
cask 'android-studio'
brew 'xcodesorg/made/xcodes'
brew 'aria2'
cask 'proxyman'
brew 'xcode-build-server'
brew 'yamllint'
brew 'mermaid-cli'
brew 'graphviz'
brew 'plantuml'
brew 'direnv'
brew 'luacheck'
brew 'pngpaste'

# AppStore {{{1
brew 'mas'
mas 'Apple Configurator 2', id: 1037126344
mas 'Gapplin', id: 768053424 # SVG Viewer

